Revit 2027 API
StairsEndConnectionType Enumeration
 The join style between a run and landing.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StairsEndConnectionType
Public Enumeration StairsEndConnectionType
public enum class StairsEndConnectionType
type StairsEndConnectionType
Members
Member name | Value | Description
Notch | 1 |  The run and landing are joined by a notch.
StraightCut | 0 |  The run and landing are joined by a straight cut.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace